CI4-Vanilla/app/Controllers/CartController.php

    public function view()
    {
        $session = session();
        $cart = $session->get('cart') ?? [];

        $products = [];
        if (!empty($cart)) {
            $productModel = new ProductModel();
            $products = $productModel->whereIn('prodCode', $cart)->findAll();
---
SELECT *
FROM `product`
WHERE `prodCode` IN ('S10_1949')