CI4-Vanilla/app/Controllers/Home2.php

    public function index2(): string
    {
        $model = new ProductModel();
        $data['products'] = $model->findAll();
---
SELECT *
FROM `product`