CI4-Vanilla/app/Controllers/WishListController.php

    public function view()
    {
        $session = session();
        $wishlist = $session->get('wishlist') ?? [];

        $products = [];
        if(!empty($wishlist)) {
            $productModel = new ProductModel();
            $products = $productModel->whereIn('prodCode', $wishlist)->findAll();
---
SELECT *
FROM `product`
WHERE `prodCode` IN ('S10_4698')