CI4projects/CI4-Vanilla/app/Controllers/AboutUsController.php

    public function index2()
    {
        $model = new ProductModel();
        $data['products'] = $model->findAll();
---
SELECT *
FROM `product`