CI4projects/CI4-Vanilla/app/Controllers/AdminProducts.php

SELECT *
FROM `product`
---
    public function index2()
    {
        $model = new ProductModel();
        $search = $this->request->getGet('search');

            if ($search) {

                $data['products'] = $model->like('prodCode', $search)
                                        ->orLike('prodDescription', $search)
                                        ->orLike('prodCategory', $search)
                                        ->orLike('prodSupplier', $search)
                                        ->findAll();
            } else {
                $data['products'] = $model->findAll();

SELECT *
FROM `product`
WHERE `product`.`prodCode` = 'S12_2823'
UPDATE `product` SET `prodSalePrice` = 240
WHERE `product`.`prodCode` IN ('S12_2823')
---
        public function sale($prodCode)
    {
        $model = new ProductModel();
        $product = $model->find($prodCode);

        if (!$product) {
            return redirect()->to('/adminProducts')->with('error', 'Product not found!');
        }


        $discount = 0.20;
        $newPrice = $product['prodSalePrice'] * (1 - $discount);

        $model->update($prodCode, ['prodSalePrice' => $newPrice]);