CI4projects/CI4-Vanilla/app/Controllers/AdminOrders.php

SELECT *
FROM `orders`
---
    public function index2()
    {
        $model = new OrderModel();
        $data['orders'] = $model->findAll();