CI4projects/CI4-Vanilla/app/Controllers/AdminCustomers.php

    public function index2()
    {
        $model = new CustomerModel();
        $data['customers'] = $model->findAll();
---
SELECT *
FROM `customer`