CI4projects/CI4-Vanilla/app/Controllers/Home2.php

SELECT *
FROM `product`
---
    public function index2(): string
    {
        $model = new ProductModel();
        $data['products'] = $model->findAll();