CI4projects/CI4-Vanilla/app/Controllers/ItemShopController.php

SELECT *
FROM `product`
---
    public function index2()
    {
        $model = new ProductModel();
        $data['products'] = $model->findAll();